[
    {
      "favorite": 4,
      "title": "Apawcalyptic Partners",
      "link": "",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/pet_finder.jpg",
      "language": "Django, React, HTML/CSS, JavaScript",
      "description": "'Apawcalyptic Partners' is a web application that was heavily inspired by one of my old projects, 'Missing Cats of America'. Unlike 'MCOA', this project provides real life data from actual shelters across the U.S. On the homepage, you are shown animals that have been recently added to the adoption site. You can also show animals that are near you (if you don't have a vpn) and search for specific animal types."
    },
    {
      "favorite": 6,
      "title": "Ruby University",
      "link": "https://github.com/RJay-Pickering/Ruby_University",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/ruby-university.png",
      "language": "Ruby",
      "description": "This project represents a fake University registration program that was created with Ruby. In this application, users engage with the program named 'Ruby Bot' to complete a mock registration process. 'Ruby Bot' assesses your eligibility for an interview based on your responses and selections. Prior to usage, please ensure you have downloaded the necessary code."
    },
    {
      "favorite": 1,
      "title": "Base Camp News",
      "link": "",
      "creator": "RJay Pickering, Will Collins, and Quinton Summerford",
      "image_url": "imageStorage/projects/BCN.jpg",
      "language": "Django, HTML/CSS, JavaScript",
      "description": "This project served as my final project at Base Camp Coding Academy. Over the course of a month, my two collaborators and I collaborated to make this project. As the team's Full-Stack developer and leader, I assisted the Back-End and Front-End to read the API's and made it mobile friendly."
    },
    {
      "favorite": 5,
      "title": "Animoo Hub",
      "link": "https://github.com/RJay-Pickering/AnimeStorage",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/animeStorage.png",
      "language": "Java, SQL",
      "description": "This project represents my work in Java and SQL, resulting in a basic CRUD (Create, Read, Update, and Delete) application called 'Animoo Hub'. 'Animoo Hub' allows users to manage their very own anime storage that they can store any anime that the user enjoys or would like to watch. To utilize this application, please ensure you have downloaded the necessary code."
    },
    {
      "favorite": 9,
      "title": "The Hacker Man",
      "link": "https://github.com/RJay-Pickering/hacker-game.git",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/Hackerman.jpeg",
      "language": "Java",
      "description": "This project represents one of my early Java projects. Its a guessing game where the player is a expert hacker whose computer has been compromised. To protect their personal information from getting leaked, they must login to their hacking program on the compromised computer to destroy the hack. However, they have forgotten their password and must attempt to guess it using their password book. This project offers an enjoyable experience and shows my basic skills of Java. To utilize this application, please ensure you have downloaded the necessary code."
    },
    {
      "favorite": 8,
      "title": "Rock, Paper, Scissors!",
      "link": "https://rjay-pickering.github.io/RockPaperScissorsGameJS/",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/RockPaperScissors.jpg",
      "language": "HTML/CSS, JavaScript",
      "description": "This project allows users to engage in a game of 'Rock, Paper, Scissors' against a computer opponent. The primary motivation behind this project was to create a straightforward game using JavaScript. During gameplay, the chosen option by the player is highlighted in a shade of yellowish green, while the computer's selection is marked in red. After each game, players can initiate a new round by pressing the 'New Game' button. The user's score is maintained between sessions but can only be reset by refreshing the page."
    },
    {
      "favorite": 2,
      "title": "Everest",
      "link": "https://rjay-pickering.github.io/JS-BOT-PROJECT-BCCA/",
      "creator": "RJay Pickering and Randy Trullet",
      "image_url": "imageStorage/projects/Everest.jpg",
      "language": "HTML/CSS, JavaScript",
      "description": "This project marks a significant milestone in my JavaScript  journey. Collaborating with a classmate, we programmed and designed the inaugural chatbot for Base Camp Coding Academy, aptly named 'Everest.' Despite being in its beta stage, this chatbot was developed within just two days. Presently, it is equipped to address frequently asked questions about Base Camp, gleaned from the director's insights. It provides fundamental information concerning Base Camp from the year of 2021."
    },
    {
      "favorite": 3,
      "title": "Missing Cats of America",
      "link": "",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/MCOA.jpg",
      "language": "Django, HTML/CSS",
      "description": "This project is named 'Missing Cats of America,' and it functions as a platform for both posting and discovering information about missing animals. Users have the ability to add details about their lost companions and view information about other missing animals to see if they have come across them. The inspiration for creating this website stemmed from an personal experience—my feline companion went missing during the period when I was learning Django, motivating me to create a resource to assist others in similar situations."
    },
    {
      "favorite": 7,
      "title": "Black Ops Fundraiser",
      "link": "https://rjay-pickering.github.io/Charity/",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/BlackOps.jpeg",
      "language": "HTML/CSS",
      "description": "This fake charity website is my first HTML and CSS project. This project centers around a campaign advocating for the revival of 'Black Ops' for the modern-generation consoles. My approach to this project prioritized a straightforward, infographic-style design, aimed at delivering essential information rather than focusing on visual appeal or entertainment value. Despite its simplicity, creating this website was an enjoyable and educational experience."
    },
    {
      "favorite": 10,
      "title": "Pokemon Safari",
      "link": "universal-terminal/pokemon-safari.html",
      "creator": "RJay Pickering and Logan Coley",
      "image_url": "imageStorage/projects/safari-park.jpg",
      "language": "Python",
      "description": "For a unit project, my classmate and I collaborated on a Python-based endeavor. We chose to create a Pokemon safari park game, featuring the third-generation Pokemon's. In this game, players experienced random encounters with wild Pokemon or could engage in battles with the gym leaders to earn Bronze, Silver, and Gold Medals. To add an extra layer of excitement, we introduced the concept of a Legendary Pokemon that players could discover and capture after achieving the Golden Medal from the battle towers."
    },
    {
      "favorite": 11,
      "title": "The Static at my Door",
      "link": "universal-terminal/static-door.html",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/static-that-calls-my-name.png",
      "language": "Python",
      "description": "During my sixth week at Base Camp, we were tasked with creating a choose-your-own-adventure game using Python with the knowledge we had acquired up to that point. The storyline of this game revolves around a sleep paralysis demon infiltrating the users house, and their mission is to find a way to evade capture by this menacing entity. Each decision you make carries consequences. The game offers multiple paths to explore, making every choice a critical juncture in your quest for survival."
    },
    {
      "favorite": 12,
      "title": "Demon Overthrow",
      "link": "universal-terminal/health-depleter.html",
      "creator": "RJay Pickering",
      "image_url": "imageStorage/projects/demon.jpg",
      "language": "Python",
      "description": "During my third week at Base Camp Coding Academy, we were tasked with creating a health-depleting game using Python and applying the knowledge we had gained up to that point. This game unfolds as the user find themselves pulled into their television by a static humanoid, subsequently awakening in a forest clearing. Confronted by three goblins and the formidable static humanoid, your objective is to engage in battles with the goblins and ultimately defeat the boss at the end of this level. "
    }
  ]